using System;
using UnityEngine;

namespace InventoryDiablo
{

    [CreateAssetMenu] [Serializable]
    public class ItemData : ScriptableObject
    {
        //-------------------------------------------------------------------------------------
        [Header("Основные настройки")]
        public Sprite ItemIcon;
        public string Title;
        public string Description;
        public ItemOnstreet Prefab;
        
        //-------------------------------------------------------------------------------------
        [Header("Размер итема на сетке")]
        public int Width = 1;
        public int Height = 1;

        //-------------------------------------------------------------------------------------
        [Header("Размер стека предмета")]
        public int MaxStackSize = 0;
        
        //-------------------------------------------------------------------------------------
        [Header("Прочие")]
        public int Price = 0;

        //список типов предметов которые могут быть совмещены с этим предметом
        // public ItemType canBeCombinedWith;
        //-------------------------------------------------------------------------------------
        [Header("Предметры типа итема")]
        public ItemType TypeItem;
        [Tools.Popup] public string ItemGroup = "Default/default";
        public ItemData[] CanBeCombined;

        //-------------------------------------------------------------------------------------
        [Header("Блок Настройки сетки" )]
        // public GridData2[] Grids;

        //-------------------------------------------------------------------------------------
        //настройки сериалиации
        // Указываем максимальную глубину сериализации
        private const int MaxDepth = 3;
        //поле для хранения текущей глубины
        [NonSerialized] private int currentDepth;
        
    //-------------------------------------------------------------------------------------


        [Flags]
        public enum ItemType
        {
            Шлем = 1 << 0, 
            Разгрузка = 1 << 1, 
            Ремень = 1 << 2, 
            Рюкзак = 1 << 3,
            Сапоги = 1 << 4,
            Оружие = 1 << 5,
            Щит = 1 << 6,
            Кольцо = 1 << 7,
            Ожерелье = 1 << 8,
            Наплечники = 1 << 9,
            Аптечка = 1 << 10,
            Зелье_маны = 1 << 11,
            Налчные_деньги = 1 << 12,
            Еда = 1 << 13,
            Обойма_патронов = 1 << 14,
            Патроны = 1 << 15,
            Коробка_патронов = 1 << 16,
            
        }
    }
}